app/controllers/todo_controller.rb

SELECT `todos`.* FROM `todos`
---
    def index
       @todos_list = Todo.all.map do |use|

INSERT INTO `todos` (`todo_text`, `due_date`, `created_at`, `updated_at`) VALUES ('i want to kill', '2022-06-23', '2022-06-27 06:27:22.099067', '2022-06-27 06:27:22.099067')
---
        def create
            todo=Todo.new(user_params)
            todo.save

SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = NULL LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 4
---
          def delete
            id = params[:del_id]
            del_todo= Todo.find(id)
            del_todo.destroy